spec/vcr/xendit/v1/ewallet/ovo/errors_duplicate_payment.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.xendit.co/ewallets/charges
    body:
      encoding: UTF-8
      string: '{"reference_id":"eacd7788-8864-421c-a39c-9c59c3ee875c","currency":"IDR","amount":4000,"checkout_method":"ONE_TIME_PAYMENT","channel_code":"ID_OVO","channel_properties":{"mobile_number":"+6282310202012"}}'
    headers:
      Authorization:
      - Basic <AUTH KEY>
      User-Agent:
      - Faraday v1.3.0
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 409
      message: Conflict
    headers:
      Cache-Control:
      - no-store, no-cache, must-revalidate, proxy-revalidate
      Content-Type:
      - application/json; charset=UTF-8
      Date:
      - Mon, 21 Jun 2021 02:53:25 GMT
      Expires:
      - '0'
      Pragma:
      - no-cache
      Server:
      - nginx
      Strict-Transport-Security:
      - max-age=2592000; includeSubDomains
      Surrogate-Control:
      - no-store
      Connection:
      - keep-alive
      Set-Cookie:
      - incap_ses_1111_2182539=n36CSRvoYmKx1oE1CBFrDyT/z2AAAAAAJAQGhzIkNo+Jf8jrKDFwpg==;
        path=/; Domain=.xendit.co
      - nlbi_2182539=6iFdNPJC+Rs+AD9OjjCKbQAAAACLI72d20+LfupdfnWxn0oZ; path=/; Domain=.xendit.co
      - visid_incap_2182539=OIX5KebLQfKMOGE8hnZT5CT/z2AAAAAAQUIPAAAAAAAQq/46cvERyAQ3ktORu7lp;
        expires=Mon, 20 Jun 2022 12:41:19 GMT; HttpOnly; path=/; Domain=.xendit.co
      X-Cdn:
      - Imperva
      Transfer-Encoding:
      - chunked
      X-Iinfo:
      - 5-9517159-9514078 pNYy RT(1624244003604 60) q(0 0 0 -1) r(13 13) U6
    body:
      encoding: ASCII-8BIT
      string: '{"error_code":"DUPLICATE_ERROR","message":"There is already a charge
        request with the same reference_id."}

'
  recorded_at: Mon, 21 Jun 2021 02:53:25 GMT
recorded_with: VCR 6.0.0
