spec/vcr/xendit/ewallet/ovo/errors_channel_unvailable.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.xendit.co/ewallets/charges
    body:
      encoding: UTF-8
      string: '{"reference_id":"125","currency":"IDR","amount":10101,"checkout_method":"ONE_TIME_PAYMENT","channel_code":"ID_OVO","channel_properties":{"mobile_number":"+6282310202012"}}'
    headers:
      Authorization:
      - Basic eG5kX2RldmVsb3BtZW50X0lNN2NzeUc0bTNjeVBPVWJwUG02VU51MHozWmtBZXNGR3dnbXVjdXk4NFBRS1NSS2xuWUdlNllqMkphNVVtQjo=
      User-Agent:
      - Faraday v1.3.0
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 503
      message: Service Unavailable
    headers:
      Cache-Control:
      - no-store, no-cache, must-revalidate, proxy-revalidate
      Content-Type:
      - application/json; charset=UTF-8
      Date:
      - Thu, 17 Jun 2021 08:24:12 GMT
      Expires:
      - '0'
      Pragma:
      - no-cache
      Server:
      - nginx
      Strict-Transport-Security:
      - max-age=2592000; includeSubDomains
      Surrogate-Control:
      - no-store
      Connection:
      - keep-alive
      Set-Cookie:
      - incap_ses_1122_2182539=Oxz0bYIiCiDtalysXyWSD6sGy2AAAAAAgOI5qFz/4UKprKeEH+KT/g==;
        path=/; Domain=.xendit.co
      - nlbi_2182539=trROTKIYoD0nGOFXjjCKbQAAAABMhvCCUBWxXAlCnDVaTIl6; path=/; Domain=.xendit.co
      - visid_incap_2182539=L1FQWmiYSO+MO2J4SipokL4Fy2AAAAAAQUIPAAAAAAAH8ozJ6tCz5kCw5o6/dzjt;
        expires=Thu, 16 Jun 2022 13:49:36 GMT; HttpOnly; path=/; Domain=.xendit.co
      X-Cdn:
      - Imperva
      Transfer-Encoding:
      - chunked
      X-Iinfo:
      - 14-4116595-4097276 pNYN RT(1623918250303 47) q(0 0 0 5) r(16 16) U6
    body:
      encoding: ASCII-8BIT
      string: '{"error_code":"CHANNEL_UNAVAILABLE","message":"The payment channel
        requested is currently experiencing unexpected issues. The eWallet provider
        will be notified to resolve this issue."}

'
  recorded_at: Thu, 17 Jun 2021 08:24:12 GMT
recorded_with: VCR 6.0.0
