spec/vcr/xendit/ewallet/ovo/errors_duplicate_payment.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.xendit.co/ewallets/charges
    body:
      encoding: UTF-8
      string: '{"reference_id":"123","currency":"IDR","amount":4000,"checkout_method":"ONE_TIME_PAYMENT","channel_code":"ID_OVO","channel_properties":{"mobile_number":"+6282310202012"}}'
    headers:
      Authorization:
      - Basic eG5kX2RldmVsb3BtZW50X0lNN2NzeUc0bTNjeVBPVWJwUG02VU51MHozWmtBZXNGR3dnbXVjdXk4NFBRS1NSS2xuWUdlNllqMkphNVVtQjo=
      User-Agent:
      - Faraday v1.3.0
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 409
      message: Conflict
    headers:
      Cache-Control:
      - no-store, no-cache, must-revalidate, proxy-revalidate
      Content-Type:
      - application/json; charset=UTF-8
      Date:
      - Thu, 17 Jun 2021 07:17:50 GMT
      Expires:
      - '0'
      Pragma:
      - no-cache
      Server:
      - nginx
      Strict-Transport-Security:
      - max-age=2592000; includeSubDomains
      Surrogate-Control:
      - no-store
      Connection:
      - keep-alive
      Set-Cookie:
      - incap_ses_1116_2182539=ulc2bZILTWG/DNZ/bNR8Dx73ymAAAAAArW2Su+DCSCe6RZ9tIq/PxA==;
        path=/; Domain=.xendit.co
      - nlbi_2182539=F7G2cyeKUHBvDf/TjjCKbQAAAABTCn/Esmnqo8JX53T0Vek8; path=/; Domain=.xendit.co
      - visid_incap_2182539=Umjh+a3cSwCsOHS/aVWL/B73ymAAAAAAQUIPAAAAAACwtgXO6HADCTICjEFHQXtz;
        expires=Thu, 16 Jun 2022 09:12:48 GMT; HttpOnly; path=/; Domain=.xendit.co
      X-Cdn:
      - Imperva
      Transfer-Encoding:
      - chunked
      X-Iinfo:
      - 9-15454787-15418900 pNYN RT(1623914268807 12) q(0 0 0 -1) r(12 12) U6
    body:
      encoding: ASCII-8BIT
      string: '{"error_code":"DUPLICATE_ERROR","message":"There is already a charge
        request with the same reference_id."}

'
  recorded_at: Thu, 17 Jun 2021 07:17:50 GMT
recorded_with: VCR 6.0.0
